app/views/shared/_user_info.html.erb

<span><%= link_to "プロフィールを確認", current_user %></span>
<span><%= pluralize(current_user.tasks.count, "task") %></span>
---
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]