app/controllers/static_pages_controller.rb

  def home
    if logged_in?
      @task = current_user.tasks.build
      @tasks = current_user.tasks.paginate(page: params[:page])
---
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]