app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "レポート提出"], ["user_id", 1], ["created_at", "2016-02-26 06:50:37.117749"], ["updated_at", "2016-02-26 06:50:37.117749"]]
---
  def create
    @task = current_user.tasks.build(task_params)
    if @task.save